# Colon1 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Colon1 Property
SymbolTypeId Class See Also
---
Symbol :1, indicating unit Ratio : 1.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Colon1 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Colon1 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Colon1 {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace